[{"model": "dashboard.resource", "pk": 1, "fields": {"what": "Registering a new user", "how": "Url : localhost:8000/accounts/register/", "category": 1, "management": true}}, {"model": "dashboard.resource", "pk": 2, "fields": {"what": "Going to the admin panel", "how": "Url : localhost:8000/admin", "category": 1, "management": true}}, {"model": "dashboard.resource", "pk": 3, "fields": {"what": "About tasks", "how": "The process of working with task can be decomposed into a few points:\r\n\r\n1. Management assigns a task to a group of people and the task becomes available into their task section.\r\n\r\n2. The group selected to work on the task then creates subtasks with the + button on the left panel of the said task.\r\n\r\n3. The group can then shares files , describe , visualize and mark subtasks as completed by toggling the orange and green indicators of the subtask tab.", "category": 2, "management": false}}, {"model": "dashboard.resource", "pk": 4, "fields": {"what": "Tasks sections", "how": "Right panel :\r\n\r\nDivided by recent files and older files . Two buttons that lead to an interface to add and delete files.\r\n\r\nMiddle panel :\r\n\r\nServes as the main display for the task description and other visualizations toggled by buttons on the left.\r\n\r\nLeft panel :\r\n\r\nThe subtask button toggles your subtasks. You can interact with them to update their details. The team button shows all the subtasks for the group and their status. You can interact with them to see the details. The team button shows all participants. And finally the expand button shows a scrolling view of all the subtasks and their details .", "category": 2, "management": false}}, {"model": "dashboard.resource", "pk": 5, "fields": {"what": "Customizing resources", "how": "1. Navigate to the admin panel ( the url is in the url section )\r\n\r\n2. Remove , edit or create Resources on the panel's left pane .\r\n\r\n3. Set a category and permissions.\r\n\r\n3. The ressources will automatically fall into their categories on this template.", "category": 2, "management": true}}]